Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
import pandas as pd
a=[4,8,16,23,42]
series =pd.Series(a)
print(series)

0     4
1     8
2    16
3    23
4    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [4]:
var1=[1,2,3,4,5,6,7,8,9,12]
data=pd.Series(var1)
print(data)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    12
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

In [5]:
data2={
    'Name':["Alice","Bob","Claire"],
    "Age":[25,30,27],
    "Gender":["Female","Male","Female"]}
df=pd.DataFrame(data2)

In [6]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, a DataFrame is a two-dimensional labeled data structure, consisting of rows and columns, that is similar to a spreadsheet or a SQL table. Each column in a DataFrame can have a different data type and can be thought of as a collection of Series objects.

A Pandas Series, on the other hand, is a one-dimensional labeled data structure that can hold any data type, such as integers, floats, strings, or even Python objects. A DataFrame can be thought of as a collection of Series objects, where each Series represents a column of data.

Here's an example to illustrate the difference between a Pandas Series and DataFrame:

In [7]:
import pandas as pd

# Creating a Pandas Series
s = pd.Series([10, 20, 30, 40, 50])
q=pd.Series([60,70])

df = pd.DataFrame({
  "numbers":s,
    "num2":q
})
print(df)

   numbers  num2
0       10  60.0
1       20  70.0
2       30   NaN
3       40   NaN
4       50   NaN

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

here are many useful functions in Pandas for manipulating data in a DataFrame, some of the most common functions include:

head() and tail(): These functions allow you to view the first or last n rows of the DataFrame. This can be useful for quickly inspecting the data to ensure it has been read in correctly or to check for any obvious errors.

info(): This function provides a summary of the DataFrame, including the number of non-null values, data types, and memory usage. This can be useful for identifying any missing or incorrect data.

describe(): This function provides a statistical summary of the DataFrame, including count, mean, standard deviation, minimum, maximum, and quartile values. This can be useful for quickly understanding the distribution of the data.

drop(): This function allows you to remove rows or columns from the DataFrame. This can be useful for removing irrelevant or duplicated data.

groupby(): This function allows you to group the data by one or more columns and perform aggregations on the groups. This can be useful for calculating summary statistics by group or for performing calculations on subsets of the data.

pivot_table(): This function allows you to create a pivot table, which is a way to summarize and aggregate data in a tabular format. This can be useful for visualizing and summarizing large amounts of data.

apply(): This function allows you to apply a function to each element, row, or column of the DataFrame. This can be useful for performing custom calculations or transformations on the data.

In [8]:
df2=pd.read_excel("LUSID Excel - Setting up your market data.xlsx")

In [9]:
df2.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,Datetimes in LUSID,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,This sheet allows you to format datetimes for...,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,If you have any questions please visit our:,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
df2.tail()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
23,NaN,NaN,NaN,NaN,Although the date can still appears without time,2019-04-10 13:30:45.550000,NaN,NaN,NaN,NaN
24,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25,NaN,NaN,NaN,NaN,Add an hour to your datetime,2019-04-10 14:30:45.550000,NaN,NaN,NaN,NaN
26,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
27,NaN,NaN,NaN,NaN,Subtract a minute from your datetime,2019-04-10 14:29:45.550000,NaN,NaN,NaN,NaN

In [11]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  0 non-null      float64
 1   Unnamed: 1  0 non-null      float64
 2   Unnamed: 2  0 non-null      float64
 3   Unnamed: 3  3 non-null      object
 4   Unnamed: 4  12 non-null     object
 5   Unnamed: 5  7 non-null      object
 6   Unnamed: 6  0 non-null      float64
 7   Unnamed: 7  6 non-null      object
 8   Unnamed: 8  4 non-null      object
 9   Unnamed: 9  1 non-null      object
dtypes: float64(4), object(6)
memory usage: 2.3+ KB

In [12]:
df2.describe()

       Unnamed: 0  Unnamed: 1  Unnamed: 2  Unnamed: 6
count         0.0         0.0         0.0         0.0
mean          NaN         NaN         NaN         NaN
std           NaN         NaN         NaN         NaN
min           NaN         NaN         NaN         NaN
25%           NaN         NaN         NaN         NaN
50%           NaN         NaN         NaN         NaN
75%           NaN         NaN         NaN         NaN
max           NaN         NaN         NaN         NaN

In [13]:
df3=pd.DataFrame(data2['Age'])
df3.sum(axis=None)

0    82
dtype: int64

df2.drop(index=[2,3])

Which of the following is mutable in nature Series, DataFrame, Panel?Which of the following is mutable in nature Series, DataFrame, Panel?

In pandas, both Series and DataFrame are mutable in nature, meaning that their contents can be modified after they are created.

On the other hand, the Panel data structure has been deprecated since pandas version 0.25.0, and is no longer recommended for use. Instead, multi-dimensional data can be represented using the more flexible and efficient MultiIndex data structure in pandas.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [5]:
import pandas as pd

s1=pd.Series([1,2,3,4,5])
s2=pd.Series([6,7,8,9,10])
s3=pd.Series([11,12,13,14,15])

data={
    'num1':s1,
    'num2':s2,
    'num3':s3}
df=pd.DataFrame(data)
df

   num1  num2  num3
0     1     6    11
1     2     7    12
2     3     8    13
3     4     9    14
4     5    10    15